Repository: averatec0773/prudence
Catalog: apps/mac/PrudenceKit/Sources/PrudenceUI/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# chart.coverageIs
source: coverage %1$@
zh_hans: 覆盖率 %1$@

# chart.hint.lines
source: Point at a week to read each project's shares with the number of lines behind them.
zh_hans: 把指针移到某一周，可以读出每个项目的比例，以及它们所基于的代码行数。

# chart.hint.weeks
source: Point at a week to read its totals; click one to filter the cards above.
zh_hans: 把指针移到某一周可以读出它的总量；点击某一周可以筛选上方的卡片。

# chart.hours
source: Active hours
zh_hans: 活跃小时

# chart.period
source: Period
zh_hans: 时段

# chart.purpose
source: Purpose
zh_hans: 用途

# chart.sampleSize
source: n=%1$@
zh_hans: %1$@ 个会话

# chart.series
source: Series
zh_hans: 系列

# chart.sessionsShort
source: sessions
zh_hans: 会话

# chart.shareOver
source: %1$@ of %2$@
zh_hans: %1$@，基于 %2$@

# chart.side
source: Side
zh_hans: 分组

# chart.value
source: Value
zh_hans: 数值

# chart.weekday
source: Day of the week
zh_hans: 星期

# common.cancel
source: Cancel
zh_hans: 取消

# common.choose
source: Choose...
zh_hans: 选择...

# common.clear
source: Clear
zh_hans: 清除

# common.dismiss
source: Dismiss
zh_hans: 关闭

# common.none
source: none
zh_hans: 无

# common.tryAgain
source: Try again
zh_hans: 重试

# compare.change
source: change %1$@
zh_hans: 变化 %1$@

# compare.nowShort
source: now
zh_hans: 本期

# compare.previous
source: previous %1$@
zh_hans: 上一期 %1$@

# compare.previousShort
source: prev
zh_hans: 上期

# contract.note
source: Nothing is drawn from a schema this build does not understand.
zh_hans: 这个版本看不懂的结构，一个数字也不会画出来。

# contract.title
source: Prudence cannot read this store
zh_hans: Prudence 读不了这个存储

# login.notAvailable
source: Only a copy in /Applications can register itself as a login item.
zh_hans: 只有放在 /Applications 里的副本才能把自己注册为登录项。

# login.requiresApproval
source: Allow Prudence in System Settings > General > Login Items.
zh_hans: 请在“系统设置 > 通用 > 登录项”中允许 Prudence。

# menu.engineChecking
source: checking...
zh_hans: 检查中...

# menu.engineMissing
source: engine not found
zh_hans: 未找到引擎

# menu.ingestFinished
source: Ingest finished.
zh_hans: 采集完成。

# menu.ingestFinishedSessions
source: Ingest finished: %1$@.
zh_hans: 采集完成：%1$@。

# menu.ingestNow
source: Ingest now
zh_hans: 立即采集

# menu.ingesting
source: Ingesting...
zh_hans: 正在采集...

# menu.justNow
source: just now
zh_hans: 刚刚

# menu.lastIngest
source: Last ingest
zh_hans: 上次采集

# menu.lastReview
source: Last review
zh_hans: 上次回顾

# menu.latestObservation
source: Latest observation
zh_hans: 最新观察

# menu.never
source: never
zh_hans: 从未

# menu.noObservation
source: No observation yet
zh_hans: 还没有观察

# menu.noReview
source: No review yet
zh_hans: 还没有回顾

# menu.noSessionsToday
source: No session recorded today
zh_hans: 今天还没有记录到会话

# menu.noTokensThisWeek
source: No tokens measured this week
zh_hans: 本周还没有测到 token

# menu.openPrudence
source: Open Prudence
zh_hans: 打开 Prudence

# menu.quit
source: Quit
zh_hans: 退出

# menu.reviewNotReady
source: Not enough new work for a review yet.
zh_hans: 新的工作量还不足以写一次回顾。

# menu.reviewNow
source: Review now
zh_hans: 立即回顾

# menu.reviewWritten
source: Review written.
zh_hans: 回顾已写入。

# menu.reviewWrittenId
source: Review %1$@ written.
zh_hans: 回顾 %1$@ 已写入。

# menu.settings
source: Settings...
zh_hans: 设置...

# menu.thisWeek
source: This week
zh_hans: 本周

# menu.today
source: Today
zh_hans: 今天

# menu.writingReview
source: Writing a review...
zh_hans: 正在写回顾...

# observation.didNot
source: that did not
zh_hans: 没有这样做

# observation.gapPoints
source: gap %1$lld points
zh_hans: 相差 %1$lld 个百分点

# observation.methodLine
source: coverage %1$@, method: %2$@ fact, %3$@ inferred
zh_hans: 覆盖率 %1$@，方法：%2$@ 条确证，%3$@ 条推断

# observation.outcome.alive
source: still at head
zh_hans: 仍留在当前版本

# observation.outcome.rework
source: reworked later
zh_hans: 后来被返工

# observation.pooledTag
source: across your projects
zh_hans: 跨项目

# observation.sentence.alive
source: %1$@, your %2$@ sessions %3$@ still have %4$@ of their lines at head (median); the %5$@ %6$@, %7$@.
zh_hans: %1$@，你有 %2$@ 个会话%3$@，它们的代码行中位数有 %4$@ 仍留在当前版本；%6$@的 %5$@ 个会话为 %7$@。

# observation.sentence.rework
source: %1$@, your %2$@ sessions %3$@ reworked %4$@ of their lines (median); the %5$@ %6$@, %7$@.
zh_hans: %1$@，你有 %2$@ 个会话%3$@，它们的代码行中位数有 %4$@ 后来被返工；%6$@的 %5$@ 个会话为 %7$@。

# observation.sessionsDidDidNot
source: %1$@ did, %2$@ did not
zh_hans: %1$@ 做了，%2$@ 个没做

# observation.short.commit_attempts_per_commit
source: 3+ commit attempts
zh_hans: 提交尝试 3 次以上

# observation.short.compactions
source: compacted context
zh_hans: 压缩了上下文

# observation.short.context_resets
source: replayed records
zh_hans: 重放了记录

# observation.short.files_edited_unread
source: edited before read
zh_hans: 先改后读

# observation.short.formatter_runs
source: ran a formatter
zh_hans: 跑了格式化

# observation.short.hand_edits_between_turns
source: hand edits
zh_hans: 手动改动

# observation.short.prompts_per_active_hour
source: above your median
zh_hans: 高于你的中位数

# observation.short.repeated_errors
source: same error 3 times
zh_hans: 同一错误 3 次

# observation.short.sittings
source: 3+ sittings
zh_hans: 分三次以上

# observation.short.subagent_used
source: used a subagent
zh_hans: 用了子代理

# observation.short.test_runs
source: ran tests
zh_hans: 跑了测试

# observation.short.tests_before_commit
source: tests before commit
zh_hans: 提交前跑测试

# observation.side.did
source: did
zh_hans: 这样做了

# observation.side.didNot
source: did not
zh_hans: 没有这样做

# observation.split.commit_attempts_per_commit
source: that attempted more than two commits for each commit counted
zh_hans: 为每个计入的提交尝试了两次以上提交

# observation.split.compactions
source: that compacted their context
zh_hans: 压缩过上下文

# observation.split.context_resets
source: that replayed an earlier session's records
zh_hans: 重放过更早会话的记录

# observation.split.files_edited_unread
source: that edited more files before reading them than your median here
zh_hans: 在阅读之前就改动了较多文件（多于你在这里的中位数）

# observation.split.formatter_runs
source: that ran a formatter
zh_hans: 运行过格式化工具

# observation.split.hand_edits_between_turns
source: that changed the tree by hand between two turns the hooks saw
zh_hans: 在钩子看到的两个回合之间手动改动过工作区

# observation.split.prompts_per_active_hour
source: that prompted more often per active hour than your median here
zh_hans: 每活跃小时的提问次数高于你在这里的中位数

# observation.split.purpose
source: labelled %1$@
zh_hans: 标记为 %1$@

# observation.split.purpose.didNot
source: labelled otherwise
zh_hans: 标记为其他用途

# observation.split.repeated_errors
source: that hit the same error three times or more
zh_hans: 三次或更多次遇到同一个错误

# observation.split.sittings
source: that ran over three or more sittings
zh_hans: 分三次或更多次进行

# observation.split.subagent_used
source: that dispatched a subagent
zh_hans: 调度过子代理

# observation.split.test_runs
source: that ran tests
zh_hans: 运行过测试

# observation.split.tests_before_commit
source: that ran tests before at least half of their commits
zh_hans: 在至少一半的提交之前运行过测试

# observation.split.unknown
source: with %1$@
zh_hans: 带有 %1$@

# observation.split.unknown.didNot
source: without it
zh_hans: 没有它

# observation.where.pooled
source: Across your projects
zh_hans: 在你的各个项目中

# observation.where.project
source: In %1$@
zh_hans: 在 %1$@ 项目中

# observations.empty.pooled.detail
source: Nothing yet holds across your projects. Choose a project above to see the rows computed from its own sessions.
zh_hans: 目前还没有跨项目成立的结论。在上方选择一个项目，可以看到由它自己的会话算出的行。

# observations.empty.pooled.title
source: No pooled observations
zh_hans: 没有跨项目的观察

# observations.empty.project.detail
source: No behaviour here clears both floors: at least five sessions on each side of the split, and enough distance between the two medians to be worth printing.
zh_hans: 这里还没有行为同时越过两个门槛：分界两边各至少五个会话，且两个中位数之间的差距足够值得写出来。

# observations.empty.project.title
source: No observations for this project
zh_hans: 这个项目还没有观察

# observations.floor
source: An observation splits your own sessions in two at one threshold and takes each side's median. These are descriptions of what happened, not advice.
zh_hans: 一条观察把你自己的会话按某个阈值分成两边，各取中位数。这些是对已发生事情的描述，不是建议。

# observations.scope.pooled
source: Pooled rows only: these are computed across your projects, for behaviours no single project had the sessions to answer, and are not a finding about any one of them.
zh_hans: 只显示跨项目的行：它们是把你所有项目合在一起算的，用于单个项目样本不足以回答的行为，并不是关于其中任何一个项目的结论。

# observations.scope.project
source: Rows computed from this project's own sessions alone.
zh_hans: 这些行只由该项目自己的会话算出。

# observations.subtitle.pooled
source: Pooled across your projects. Choose a project for its own.
zh_hans: 跨你的各个项目合并计算。选择一个项目可只看它自己。

# observations.subtitle.project
source: In %1$@.
zh_hans: 在 %1$@ 项目中。

# observations.threshold
source: Threshold: %1$@
zh_hans: 阈值：%1$@

# overview.activeHours
source: Active hours
zh_hans: 活跃小时

# overview.allPurposes
source: all purposes
zh_hans: 全部用途

# overview.commitsInRange
source: Commits in range
zh_hans: 范围内提交

# overview.editsNotMeasured
source: edits not measured
zh_hans: 未测到编辑

# overview.factInferred
source: %1$@ fact, %2$@ inferred
zh_hans: %1$@ 条确证，%2$@ 条推断

# overview.legend.alive
source: solid: alive at 30 days
zh_hans: 实线：30 天后仍存活

# overview.legend.aliveName
source: alive at 30 days
zh_hans: 30 天后仍存活

# overview.legend.coverage
source: pale wide: coverage
zh_hans: 浅色宽线：覆盖率

# overview.legend.coverageName
source: coverage
zh_hans: 覆盖率

# overview.legend.rework
source: dashed: reworked later
zh_hans: 虚线：后来被返工

# overview.legend.reworkName
source: reworked later
zh_hans: 后来被返工

# overview.noHours.detail
source: No session in this range recorded any active minutes. A Claude Code version that writes no usage fields leaves this empty, which is not the same as no work.
zh_hans: 这个范围内没有会话记录到活跃分钟数。有些 Claude Code 版本不写用量字段，会让这里空着，这和没有工作并不是一回事。

# overview.noHours.title
source: No active time in this range
zh_hans: 这个范围内没有活跃时间

# overview.noOutcomes.detail
source: No commit in this range is credited with a line that could be followed. A repository where other people commit has its outcomes withheld rather than guessed.
zh_hans: 这个范围内没有提交被认定写下了可追踪的代码行。有其他人提交的仓库，其成果会被保留不报，而不是猜测。

# overview.noOutcomes.title
source: No outcomes to follow yet
zh_hans: 还没有可以追踪的成果

# overview.noTokens.detail
source: Nothing here measured any tokens. A Claude Code version that wrote no usage fields is not zero tokens; it is no measurement at all.
zh_hans: 这里没有测到任何 token。没有写下用量字段的 Claude Code 版本不等于零 token，而是根本没有测量。

# overview.noTokens.title
source: No tokens in this range
zh_hans: 这个范围内没有 token

# overview.sessionsInRange
source: Sessions in range
zh_hans: 范围内会话

# overview.showAllWeeks
source: Show the whole range
zh_hans: 显示整个范围

# overview.sittingsNote
source: sum of each session's sittings
zh_hans: 每个会话各次连续工作时长之和

# overview.tokensByPurpose
source: Tokens by purpose, per week
zh_hans: 按用途统计的每周 token

# overview.tokensByPurpose.note
source: Summed from app_usage_by_purpose_day into the ISO week each local day falls in. A session's tokens are counted on the day its first record was written.
zh_hans: 由 app_usage_by_purpose_day 按本地日期所属的 ISO 周汇总。一个会话的 token 计在它第一条记录写下的那一天。

# overview.weekFilter
source: The cards above are the week of %1$@: %2$@ tokens.
zh_hans: 上方的卡片只统计 %1$@ 那一周：%2$@ tokens。

# overview.weekOf
source: Week of %1$@
zh_hans: %1$@ 当周

# overview.whatBecame
source: What became of each week's work
zh_hans: 每周的成果后来怎样了

# overview.whatBecame.note
source: alive_30d / measured_30d and reworked / lines, both from app_outcomes_by_week. A week whose 30-day mark has not arrived is a gap, never a zero. The pale wide line is that week's mean coverage: the share of a counted commit's added lines the session itself wrote.
zh_hans: alive_30d / measured_30d 与 reworked / lines，都来自 app_outcomes_by_week。30 天标记尚未到达的周是断口，不是零。浅色宽线是该周的平均覆盖率：计入的提交所新增的代码行中，由会话自己写下的比例。

# overview.whereTime
source: Where the hours went
zh_hans: 时间花在了哪里

# overview.whereTime.note
source: Active minutes per local day, summed off app_usage_by_purpose_day. A day with no session has no row at all, so an empty cell is not a measured zero.
zh_hans: 按本地日期汇总 app_usage_by_purpose_day 的活跃分钟数。没有会话的那一天在视图里根本没有行，所以空白格并不表示测得的零。

# purpose.conversation
source: conversation
zh_hans: 对话

# purpose.debugging
source: debugging
zh_hans: 调试

# purpose.development
source: development
zh_hans: 开发

# purpose.mixed
source: mixed
zh_hans: 混合

# purpose.research
source: research
zh_hans: 调研

# purpose.unknown
source: other
zh_hans: 其他

# range.all
source: All
zh_hans: 全部

# range.eightWeeks
source: 8 weeks
zh_hans: 8 周

# range.everyDay
source: every day on record
zh_hans: 有记录的每一天

# range.ninetyDays
source: 90 days
zh_hans: 90 天

# range.since
source: since %1$@
zh_hans: 自 %1$@ 起

# review.card.coverage
source: Mean coverage
zh_hans: 平均覆盖率

# review.coverageHelp
source: The mean share of a counted commit's added lines the session itself wrote, over the commits in the outcome window.
zh_hans: 在结果窗口内的提交中，会话自己写下的新增代码行所占比例的平均值。

# review.coverageOfRow
source: This review's coverage is %1$@.
zh_hans: 这份回顾的覆盖率是 %1$@。

# review.coverageUnderlay
source: The pale underlay behind each bar is that figure's coverage.
zh_hans: 每根条形背后的浅色底衬就是这个数字的覆盖率。

# review.empty.detail
source: A review is written on demand and kept. Press Review now, or run `prudence review` in a terminal; it needs a few new sessions and one commit that has crossed seven days.
zh_hans: 回顾是按需写入并保存下来的。点「现在回顾」，或者在终端里运行 `prudence review`；它需要几个新的会话，以及至少一个已经过了七天的提交。

# review.empty.title
source: No review yet
zh_hans: 还没有回顾

# review.figuresHelp
source: Every number on this page, each one re-derivable from the CLI.
zh_hans: 这一页上的每一个数字，都可以用命令行重新算出来。

# review.headline
source: Review %1$@, %2$@ to %3$@
zh_hans: 回顾 %1$@，%2$@ 至 %3$@

# review.headline.project
source: Review %1$@, %2$@ to %3$@, %4$@
zh_hans: 回顾 %1$@，%2$@ 至 %3$@，%4$@

# review.noneStored
source: none stored
zh_hans: 没有存储的回顾

# review.notReady.title
source: Not ready for a review yet
zh_hans: 还不到写回顾的时候

# review.option
source: Review %1$@ - %2$@
zh_hans: 回顾 %1$@ - %2$@

# review.provenance
source: Every figure above is computed from your own record: %1$@ numbers, each re-derivable with `prudence usage`, `prudence outcomes` or `prudence observations` over the same range.
zh_hans: 上面的每个数字都来自你自己的记录：共 %1$@ 个数字，每一个都可以在同一范围上用 `prudence usage`、`prudence outcomes` 或 `prudence observations` 重新算出来。

# review.scope.everyProject
source: every project
zh_hans: 所有项目

# review.segment.checked
source: Every number in it was checked against the review's own figures.
zh_hans: 其中的每个数字都与这份回顾自己的数字核对过。

# review.subtitle.none
source: No review has been written yet.
zh_hans: 还没有写过任何回顾。

# review.subtitle.scope
source: %1$@, written %2$@.
zh_hans: %1$@，写于 %2$@。

# review.tag.coverage
source: coverage
zh_hans: 覆盖率

# review.tag.figures
source: figures
zh_hans: 数字

# review.tag.scope
source: scope
zh_hans: 范围

# review.tag.written
source: written
zh_hans: 写于

# review.unknownSection
source: A section this version of the app does not lay out; here it is as stored.
zh_hans: 这个版本的应用还没有为这个区块排版，下面是它存储时的样子。

# review.unreadable.detail
source: The stored JSON is not in a shape this build understands. The row above is still true; only its body is unreadable.
zh_hans: 存储的 JSON 不是这个版本能理解的结构。上面那一行仍然成立，只是正文读不出来。

# review.unreadable.title
source: This review's sections cannot be read
zh_hans: 这份回顾的区块读不出来

# review.whatThisMeans
source: What this means
zh_hans: 这意味着什么

# review.writeAnyway
source: Write anyway
zh_hans: 仍然写入

# review.writing
source: Writing...
zh_hans: 正在写入...

# review.writtenBy
source: Written by %1$@
zh_hans: 由 %1$@ 写成

# scope.allProjects
source: All projects
zh_hans: 全部项目

# scope.project
source: Project
zh_hans: 项目

# scope.project.help
source: Every figure below is for this project alone.
zh_hans: 下面的每个数字都只属于这个项目。

# scope.range
source: Range
zh_hans: 范围

# scope.range.help
source: How far back the charts look. Eight weeks is the default.
zh_hans: 图表回看多远。默认是八周。

# section.observations
source: Observations
zh_hans: 观察

# section.overview
source: Overview
zh_hans: 总览

# section.review
source: Review
zh_hans: 回顾

# section.settings
source: Settings
zh_hans: 设置

# settings.data
source: Data
zh_hans: 数据

# settings.databasePath
source: Database
zh_hans: 数据库

# settings.databasePath.note
source: Reading %1$@ (%2$@).
zh_hans: 正在读取 %1$@（%2$@）。

# settings.enginePath
source: Prudence engine
zh_hans: Prudence 引擎

# settings.enginePath.note
source: Looked for in uv's bin directories, then Homebrew, then your login shell.
zh_hans: 依次在 uv 的 bin 目录、Homebrew、你的登录 shell 中查找。

# settings.enginePath.override
source: Overriding the search.
zh_hans: 正在覆盖自动查找。

# settings.foundAutomatically
source: found automatically
zh_hans: 自动找到

# settings.general
source: General
zh_hans: 通用

# settings.language
source: Language
zh_hans: 语言

# settings.language.note
source: The app's own strings. Engine sentences and the CLI stay English; the app rebuilds observation sentences from the numbers.
zh_hans: 只影响 App 自己的文案。引擎生成的句子和命令行仍是英文；App 会用数字在界面层重新组织观察句。

# settings.language.relaunch
source: Takes effect after a relaunch.
zh_hans: 重新启动后生效。

# settings.language.relaunchNow
source: Relaunch
zh_hans: 重新启动

# settings.language.system
source: System
zh_hans: 跟随系统

# settings.language.systemSettings
source: A per-app language also lives in System Settings > General > Language & Region.
zh_hans: “系统设置 > 通用 > 语言与地区”里也可以为单个 App 指定语言。

# settings.openAtLogin
source: Open at login
zh_hans: 登录时打开

# settings.source.environment
source: from %1$@
zh_hans: 来自 %1$@

# settings.source.settings
source: from Settings
zh_hans: 来自「设置」

# settings.source.standard
source: the standard location
zh_hans: 标准位置

# settings.store
source: Store
zh_hans: 存储

# settings.store.line
source: engine %1$@ · app contract %2$@ · %3$@ · %4$@
zh_hans: 引擎 %1$@ · App 契约 %2$@ · %3$@ · %4$@

# settings.store.unread
source: not read yet
zh_hans: 尚未读取

# settings.timedIngest
source: Ingest every 30 minutes
zh_hans: 每 30 分钟采集一次

# settings.timedIngest.note
source: Runs prudence ingest in the background. The hooks already spool events; this is what turns them into rows.
zh_hans: 在后台运行 prudence ingest。钩子已经把事件排入队列，这一项负责把它们变成记录。

# settings.title
source: Settings
zh_hans: 设置

# unit.commits
source: %1$lld commits
zh_hans: %1$lld 次提交

# unit.edits
source: %1$lld edits
zh_hans: %1$lld 次编辑

# unit.hours
source: %1$@ hours
zh_hans: %1$@ 小时

# unit.projects
source: %1$lld projects
zh_hans: %1$lld 个项目

# unit.sessions
source: %1$lld sessions
zh_hans: %1$lld 个会话

# unit.tokens
source: %1$@ tokens
zh_hans: %1$@ token

# weekday.fri
source: Fri
zh_hans: 五

# weekday.mon
source: Mon
zh_hans: 一

# weekday.sat
source: Sat
zh_hans: 六

# weekday.sun
source: Sun
zh_hans: 日

# weekday.thu
source: Thu
zh_hans: 四

# weekday.tue
source: Tue
zh_hans: 二

# weekday.wed
source: Wed
zh_hans: 三
